In [1]:
import pandas as pd

In [2]:
school_id = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]
school_id

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [3]:
school_name = ["Huang", "Fig", "Shel", "Hern", "Griff", "Wilson", "Cab", "Vailey", 
               "Holden", "Pena", "Wright", "Rod", "John", "Ford", "Thomas"]
school_name

['Huang',
 'Fig',
 'Shel',
 'Hern',
 'Griff',
 'Wilson',
 'Cab',
 'Vailey',
 'Holden',
 'Pena',
 'Wright',
 'Rod',
 'John',
 'Ford',
 'Thomas']

In [4]:
school_type = [ "Dis", "Dis", "Char", "Dis", "Char","Char", 
               "Char", "Dis", "Char", "Char", "Char", "Dis", "Dis", "Dis", "Char"]
school_type

['Dis',
 'Dis',
 'Char',
 'Dis',
 'Char',
 'Char',
 'Char',
 'Dis',
 'Char',
 'Char',
 'Char',
 'Dis',
 'Dis',
 'Dis',
 'Char']

In [10]:
school_dict = {"ID" : school_id, "Name" : school_name, "Type" : school_type}
school_df = pd.DataFrame(school_dict)
school_df

    ID    Name  Type
0    0   Huang   Dis
1    1     Fig   Dis
2    2    Shel  Char
3    3    Hern   Dis
4    4   Griff  Char
5    5  Wilson  Char
6    6     Cab  Char
7    7  Vailey   Dis
8    8  Holden  Char
9    9    Pena  Char
10  10  Wright  Char
11  11     Rod   Dis
12  12    John   Dis
13  13    Ford   Dis
14  14  Thomas  Char